zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_INPUTMUX.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- INPUTMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Peripheral_Access_Layer INPUTMUX Peripheral Access Layer
 * @{
 */

/** INPUTMUX - Size of Registers Arrays */
#define INPUTMUX_INPUTMUX_SCT0_COUNT              8u
#define INPUTMUX_INPUTMUX_SMARTDMA_COUNT          8u
#define INPUTMUX_INPUTMUX_GPIO_INT_COUNT          8u
#define INPUTMUX_ADC0_TRIGM_COUNT                 4u
#define INPUTMUX_ADC1_TRIGN_COUNT                 4u
#define INPUTMUX_QDCN_COUNT                       2u
#define INPUTMUX_FLEXPWM_SM_EXTSYNC_COUNT         4u
#define INPUTMUX_FLEXPWM_SM_EXT_COUNT             4u
#define INPUTMUX_FLEXPWM_FAULT_COUNT              4u
#define INPUTMUX_FLEXPWM1_SM_EXTSYNC_ARRAY_COUNT  4u
#define INPUTMUX_FLEXPWM_SM1_EXTA_ARRAY_COUNT     4u
#define INPUTMUX_FLEXPWM1_FAULT_COUNT             4u
#define INPUTMUX_EVTG_TRIGN_COUNT                 16u
#define INPUTMUX_EXT_TRIGN_COUNT                  8u
#define INPUTMUX_SINC_FILTER_CHN_COUNT            5u
#define INPUTMUX_OPAMPN_TRIG_COUNT                3u
#define INPUTMUX_FLEXIO_TRIGN_COUNT               8u

/** INPUTMUX - Register Layout Typedef */
typedef struct {
  __IO uint32_t SCT0_INMUX[INPUTMUX_INPUTMUX_SCT0_COUNT]; /**< Inputmux Register for SCT0 Input, array offset: 0x0, array step: 0x4 */
  __IO uint32_t CTIMER0CAP0;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x20 */
  __IO uint32_t CTIMER0CAP1;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x24 */
  __IO uint32_t CTIMER0CAP2;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x28 */
  __IO uint32_t CTIMER0CAP3;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x2C */
  __IO uint32_t TIMER0TRIG;                        /**< Trigger Register for CTIMER, offset: 0x30 */
       uint8_t RESERVED_0[12];
  __IO uint32_t CTIMER1CAP0;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x40 */
  __IO uint32_t CTIMER1CAP1;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x44 */
  __IO uint32_t CTIMER1CAP2;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x48 */
  __IO uint32_t CTIMER1CAP3;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x4C */
  __IO uint32_t TIMER1TRIG;                        /**< Trigger Register for CTIMER, offset: 0x50 */
       uint8_t RESERVED_1[12];
  __IO uint32_t CTIMER2CAP0;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x60 */
  __IO uint32_t CTIMER2CAP1;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x64 */
  __IO uint32_t CTIMER2CAP2;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x68 */
  __IO uint32_t CTIMER2CAP3;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x6C */
  __IO uint32_t TIMER2TRIG;                        /**< Trigger Register for CTIMER, offset: 0x70 */
       uint8_t RESERVED_2[44];
  __IO uint32_t SMARTDMAARCHB_INMUX[INPUTMUX_INPUTMUX_SMARTDMA_COUNT]; /**< Inputmux Register for SMARTDMA Arch B Inputs, array offset: 0xA0, array step: 0x4 */
  __IO uint32_t PINTSEL[INPUTMUX_INPUTMUX_GPIO_INT_COUNT]; /**< Pin Interrupt Select, array offset: 0xC0, array step: 0x4 */
       uint8_t RESERVED_3[160];
  __IO uint32_t FREQMEAS_REF;                      /**< Selection for Frequency Measurement Reference Clock, offset: 0x180 */
  __IO uint32_t FREQMEAS_TAR;                      /**< Selection for Frequency Measurement Target Clock, offset: 0x184 */
       uint8_t RESERVED_4[24];
  __IO uint32_t CTIMER3CAP0;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1A0 */
  __IO uint32_t CTIMER3CAP1;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1A4 */
  __IO uint32_t CTIMER3CAP2;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1A8 */
  __IO uint32_t CTIMER3CAP3;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1AC */
  __IO uint32_t TIMER3TRIG;                        /**< Trigger Register for CTIMER, offset: 0x1B0 */
       uint8_t RESERVED_5[12];
  __IO uint32_t CTIMER4CAP0;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1C0 */
  __IO uint32_t CTIMER4CAP1;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1C4 */
  __IO uint32_t CTIMER4CAP2;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1C8 */
  __IO uint32_t CTIMER4CAP3;                       /**< Capture Select Register for CTIMER Inputs, offset: 0x1CC */
  __IO uint32_t TIMER4TRIG;                        /**< Trigger Register for CTIMER, offset: 0x1D0 */
       uint8_t RESERVED_6[140];
  __IO uint32_t CMP0_TRIG;                         /**< CMP0 Input Connections, offset: 0x260 */
       uint8_t RESERVED_7[28];
  __IO uint32_t ADC0_TRIG[INPUTMUX_ADC0_TRIGM_COUNT]; /**< ADC Trigger Input Connections, array offset: 0x280, array step: 0x4 */
       uint8_t RESERVED_8[48];
  __IO uint32_t ADC1_TRIG[INPUTMUX_ADC1_TRIGN_COUNT]; /**< ADC Trigger Input Connections, array offset: 0x2C0, array step: 0x4 */
       uint8_t RESERVED_9[48];
  __IO uint32_t DAC0_TRIG;                         /**< DAC0 Trigger Inputs, offset: 0x300 */
       uint8_t RESERVED_10[28];
  __IO uint32_t DAC1_TRIG;                         /**< DAC1 Trigger Inputs, offset: 0x320 */
       uint8_t RESERVED_11[28];
  __IO uint32_t DAC2_TRIG;                         /**< DAC2 Trigger Inputs, offset: 0x340 */
       uint8_t RESERVED_12[28];
  struct {                                         /* offset: 0x360, array step: 0x20 */
    __IO uint32_t QDC_TRIG;                          /**< QDC0 Trigger Input Connections..QDC1 Trigger Input Connections, array offset: 0x360, array step: 0x20 */
    __IO uint32_t QDC_HOME;                          /**< QDC0 Input Connections..QDC1 Input Connections, array offset: 0x364, array step: 0x20 */
    __IO uint32_t QDC_INDEX;                         /**< QDC0 Input Connections..QDC1 Input Connections, array offset: 0x368, array step: 0x20 */
    __IO uint32_t QDC_PHASEB;                        /**< QDC0 Input Connections..QDC1 Input Connections, array offset: 0x36C, array step: 0x20 */
    __IO uint32_t QDC_PHASEA;                        /**< QDC0 Input Connections..QDC1 Input Connections, array offset: 0x370, array step: 0x20 */
         uint8_t RESERVED_0[12];
  } QDCN[INPUTMUX_QDCN_COUNT];
  __IO uint32_t FLEXPWM0_SM_EXTSYNC[INPUTMUX_FLEXPWM_SM_EXTSYNC_COUNT]; /**< PWM0 External Synchronization, array offset: 0x3A0, array step: 0x4 */
  __IO uint32_t FLEXPWM0_SM_EXTA[INPUTMUX_FLEXPWM_SM_EXT_COUNT]; /**< PWM0 Input Trigger Connections, array offset: 0x3B0, array step: 0x4 */
  __IO uint32_t FLEXPWM0_EXTFORCE;                 /**< PWM0 External Force Trigger Connections, offset: 0x3C0 */
  __IO uint32_t FLEXPWM0_FAULT[INPUTMUX_FLEXPWM_FAULT_COUNT]; /**< PWM0 Fault Input Trigger Connections, array offset: 0x3C4, array step: 0x4 */
       uint8_t RESERVED_13[12];
  __IO uint32_t FLEXPWM1_SM_EXTSYNC[INPUTMUX_FLEXPWM1_SM_EXTSYNC_ARRAY_COUNT]; /**< PWM1 External Synchronization, array offset: 0x3E0, array step: 0x4 */
  __IO uint32_t FLEXPWM1_SM_EXTA[INPUTMUX_FLEXPWM_SM1_EXTA_ARRAY_COUNT]; /**< PWM1 Input EXTA Connections, array offset: 0x3F0, array step: 0x4 */
  __IO uint32_t FLEXPWM1_EXTFORCE;                 /**< PWM1 External Force Trigger Connections, offset: 0x400 */
  __IO uint32_t FLEXPWM1_FAULT[INPUTMUX_FLEXPWM1_FAULT_COUNT]; /**< PWM1 Fault Input Trigger Connections, array offset: 0x404, array step: 0x4 */
       uint8_t RESERVED_14[12];
  __IO uint32_t PWM0_EXT_CLK;                      /**< PWM0 External Clock Trigger, offset: 0x420 */
  __IO uint32_t PWM1_EXT_CLK;                      /**< PWM1 External Clock Trigger, offset: 0x424 */
       uint8_t RESERVED_15[24];
  __IO uint32_t EVTG_TRIG[INPUTMUX_EVTG_TRIGN_COUNT]; /**< EVTG Trigger Input Connections, array offset: 0x440, array step: 0x4 */
  __IO uint32_t USBFS_TRIG;                        /**< USB-FS Trigger Input Connections, offset: 0x480 */
       uint8_t RESERVED_16[28];
  __IO uint32_t TSI_TRIG;                          /**< TSI Trigger Input Connections, offset: 0x4A0 */
       uint8_t RESERVED_17[28];
  __IO uint32_t EXT_TRIG[INPUTMUX_EXT_TRIGN_COUNT]; /**< EXT Trigger Connections, array offset: 0x4C0, array step: 0x4 */
  __IO uint32_t CMP1_TRIG;                         /**< CMP1 Input Connections, offset: 0x4E0 */
       uint8_t RESERVED_18[28];
  __IO uint32_t CMP2_TRIG;                         /**< CMP2 Input Connections, offset: 0x500 */
       uint8_t RESERVED_19[28];
  __IO uint32_t SINC_FILTER_CH[INPUTMUX_SINC_FILTER_CHN_COUNT]; /**< SINC Filter Channel Trigger Input Connections, array offset: 0x520, array step: 0x4 */
       uint8_t RESERVED_20[76];
  __IO uint32_t OPAMP_TRIG[INPUTMUX_OPAMPN_TRIG_COUNT]; /**< OPAMP Trigger Input Connections, array offset: 0x580, array step: 0x4 */
       uint8_t RESERVED_21[20];
  __IO uint32_t FLEXCOMM0_TRIG;                    /**< LP_FLEXCOMM0 Trigger Input Connections, offset: 0x5A0 */
       uint8_t RESERVED_22[28];
  __IO uint32_t FLEXCOMM1_TRIG;                    /**< LP_FLEXCOMM1 Trigger Input Connections, offset: 0x5C0 */
       uint8_t RESERVED_23[28];
  __IO uint32_t FLEXCOMM2_TRIG;                    /**< LP_FLEXCOMM2 Trigger Input Connections, offset: 0x5E0 */
       uint8_t RESERVED_24[28];
  __IO uint32_t FLEXCOMM3_TRIG;                    /**< LP_FLEXCOMM3 Trigger Input Connections, offset: 0x600 */
       uint8_t RESERVED_25[28];
  __IO uint32_t FLEXCOMM4_TRIG;                    /**< LP_FLEXCOMM4 Trigger Input Connections, offset: 0x620 */
       uint8_t RESERVED_26[28];
  __IO uint32_t FLEXCOMM5_TRIG;                    /**< LP_FLEXCOMM5 Trigger Input Connections, offset: 0x640 */
       uint8_t RESERVED_27[28];
  __IO uint32_t FLEXCOMM6_TRIG;                    /**< LP_FLEXCOMM6 Trigger Input Connections, offset: 0x660 */
       uint8_t RESERVED_28[28];
  __IO uint32_t FLEXCOMM7_TRIG;                    /**< LP_FLEXCOMM7 Trigger Input Connections, offset: 0x680 */
       uint8_t RESERVED_29[28];
  __IO uint32_t FLEXCOMM8_TRIG;                    /**< LP_FLEXCOMM8 Trigger Input Connections, offset: 0x6A0 */
       uint8_t RESERVED_30[28];
  __IO uint32_t FLEXCOMM9_TRIG;                    /**< LP_FLEXCOMM9 Trigger Input Connections, offset: 0x6C0 */
       uint8_t RESERVED_31[28];
  __IO uint32_t FLEXIO_TRIG[INPUTMUX_FLEXIO_TRIGN_COUNT]; /**< FlexIO Trigger Input Connections, array offset: 0x6E0, array step: 0x4 */
  __IO uint32_t DMA0_REQ_ENABLE0;                  /**< DMA0 Request Enable0, offset: 0x700 */
  __O  uint32_t DMA0_REQ_ENABLE0_SET;              /**< DMA0 Request Enable0, offset: 0x704 */
  __O  uint32_t DMA0_REQ_ENABLE0_CLR;              /**< DMA0 Request Enable0, offset: 0x708 */
  __O  uint32_t DMA0_REQ_ENABLE0_TOG;              /**< DMA0 Request Enable0, offset: 0x70C */
  __IO uint32_t DMA0_REQ_ENABLE1;                  /**< DMA0 Request Enable1, offset: 0x710 */
  __O  uint32_t DMA0_REQ_ENABLE1_SET;              /**< DMA0 Request Enable1, offset: 0x714 */
  __O  uint32_t DMA0_REQ_ENABLE1_CLR;              /**< DMA0 Request Enable1, offset: 0x718 */
  __O  uint32_t DMA0_REQ_ENABLE1_TOG;              /**< DMA0 Request Enable1, offset: 0x71C */
  __IO uint32_t DMA0_REQ_ENABLE2;                  /**< DMA0 Request Enable2, offset: 0x720 */
  __O  uint32_t DMA0_REQ_ENABLE2_SET;              /**< DMA0 Request Enable2, offset: 0x724 */
  __O  uint32_t DMA0_REQ_ENABLE2_CLR;              /**< DMA0 Request Enable2, offset: 0x728 */
  __O  uint32_t DMA0_REQ_ENABLE2_TOG;              /**< DMA0 Request Enable2, offset: 0x72C */
  __IO uint32_t DMA0_REQ_ENABLE3;                  /**< DMA0 Request Enable3, offset: 0x730 */
  __O  uint32_t DMA0_REQ_ENABLE3_SET;              /**< DMA0 Request Enable3, offset: 0x734 */
  __O  uint32_t DMA0_REQ_ENABLE3_CLR;              /**< DMA0 Request Enable3, offset: 0x738 */
       uint8_t RESERVED_32[68];
  __IO uint32_t DMA1_REQ_ENABLE0;                  /**< DMA1 Request Enable0, offset: 0x780 */
  __O  uint32_t DMA1_REQ_ENABLE0_SET;              /**< DMA1 Request Enable0, offset: 0x784 */
  __O  uint32_t DMA1_REQ_ENABLE0_CLR;              /**< DMA1 Request Enable0, offset: 0x788 */
  __O  uint32_t DMA1_REQ_ENABLE0_TOG;              /**< DMA1 Request Enable0, offset: 0x78C */
  __IO uint32_t DMA1_REQ_ENABLE1;                  /**< DMA1 Request Enable1, offset: 0x790 */
  __O  uint32_t DMA1_REQ_ENABLE1_SET;              /**< DMA1 Request Enable1, offset: 0x794 */
  __O  uint32_t DMA1_REQ_ENABLE1_CLR;              /**< DMA1 Request Enable1, offset: 0x798 */
  __O  uint32_t DMA1_REQ_ENABLE1_TOG;              /**< DMA1 Request Enable1, offset: 0x79C */
  __IO uint32_t DMA1_REQ_ENABLE2;                  /**< DMA1 Request Enable2, offset: 0x7A0 */
  __O  uint32_t DMA1_REQ_ENABLE2_SET;              /**< DMA1 Request Enable2, offset: 0x7A4 */
  __O  uint32_t DMA1_REQ_ENABLE2_CLR;              /**< DMA1 Request Enable2, offset: 0x7A8 */
  __O  uint32_t DMA1_REQ_ENABLE2_TOG;              /**< DMA1 Request Enable2, offset: 0x7AC */
  __IO uint32_t DMA1_REQ_ENABLE3;                  /**< DMA1 Request Enable3, offset: 0x7B0 */
  __O  uint32_t DMA1_REQ_ENABLE3_SET;              /**< DMA1 Request Enable3, offset: 0x7B4 */
  __O  uint32_t DMA1_REQ_ENABLE3_CLR;              /**< DMA1 Request Enable3, offset: 0x7B8 */
} INPUTMUX_Type;

/* ----------------------------------------------------------------------------
   -- INPUTMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Register_Masks INPUTMUX Register Masks
 * @{
 */

/*! @name INPUTMUX_SCT0_SCT0_INMUX - Inputmux Register for SCT0 Input */
/*! @{ */

#define INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX_INP_MASK (0x7FU)
#define INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX_INP_SHIFT (0U)
/*! INP - Input number to SCT0 inputs.
 *  0b0000000..SCT0_IN0 input is selected
 *  0b0000001..SCT0_IN1 input is selected
 *  0b0000010..SCT0_IN2 input is selected
 *  0b0000011..SCT0_IN3 input is selected
 *  0b0000100..SCT0_IN4 input is selected
 *  0b0000101..SCT0_IN5 input is selected
 *  0b0000110..SCT0_IN6 input is selected
 *  0b0000111..SCT0_IN7 input is selected
 *  0b0001000..CTIMER0_MAT0 input is selected
 *  0b0001001..CTIMER1_MAT0 input is selected
 *  0b0001010..CTIMER2_MAT0 input is selected
 *  0b0001011..CTIMER3_MAT0 input is selected
 *  0b0001100..CTIMER4_MAT0 input is selected
 *  0b0001101..ADC0 ADC0_IRQ input is selected
 *  0b0001110..PINT GPIO_INT_BMAT input is selected
 *  0b0001111..usb0 start of frame input is selected
 *  0b0010000..usb1 start of frame input is selected
 *  0b0010001..SINC Filter CH0 Conversion Complete input is selected
 *  0b0010010..SINC Filter CH1 Conversion Complete input is selected
 *  0b0010011..SINC Filter CH2 Conversion Complete input is selected
 *  0b0010100..SINC Filter CH3 Conversion Complete input is selected
 *  0b0010101..SINC Filter CH4 Conversion Complete input is selected
 *  0b0010110..Reserved
 *  0b0010111..DEBUG_HALTED input is selected
 *  0b0011000..ADC1_IRQ input is selected
 *  0b0011001..ADC0_tcomp[0] input is selected
 *  0b0011010..ADC0_tcomp[1] input is selected
 *  0b0011011..ADC0_tcomp[2] input is selected
 *  0b0011100..ADC0_tcomp[3] input is selected
 *  0b0011101..ADC1_tcomp[0] input is selected
 *  0b0011110..ADC1_tcomp[1] input is selected
 *  0b0011111..ADC1_tcomp[2] input is selected
 *  0b0100000..ADC1_tcomp[3] input is selected
 *  0b0100001..CMP0_OUT input is selected
 *  0b0100010..CMP1_OUT input is selected
 *  0b0100011..CMP2_OUT input is selected
 *  0b0100100..PWM0_SM0_MUX_TRIG0/PWM0_SM0_MUX_TRIG1 input is selected
 *  0b0100101..PWM0_SM1_MUX_TRIG0/PWM0_SM1_MUX_TRIG1 input is selected
 *  0b0100110..PWM0_SM2_MUX_TRIG0/PWM0_SM2_MUX_TRIG1 input is selected
 *  0b0100111..PWM0_SM3_MUX_TRIG0/PWM0_SM3_MUX_TRIG1 input is selected
 *  0b0101000..PWM1_SM0_MUX_TRIG0/PWM1_SM0_MUX_TRIG1 input is selected
 *  0b0101001..PWM1_SM1_MUX_TRIG0/PWM1_SM1_MUX_TRIG1 input is selected
 *  0b0101010..PWM1_SM2_MUX_TRIG0/PWM1_SM2_MUX_TRIG1 input is selected
 *  0b0101011..PWM1_SM3_MUX_TRIG0/PWM1_SM3_MUX_TRIG1 input is selected
 *  0b0101100..QDC0_CMP/POS_MATCH input is selected
 *  0b0101101..QDC1_CMP/POS_MATCH input is selected
 *  0b0101110..EVTG_OUT0A input is selected
 *  0b0101111..EVTG_OUT0B input is selected
 *  0b0110000..EVTG_OUT1A input is selected
 *  0b0110001..EVTG_OUT1B input is selected
 *  0b0110010..EVTG_OUT2A input is selected
 *  0b0110011..EVTG_OUT2B input is selected
 *  0b0110100..EVTG_OUT3A input is selected
 *  0b0110101..EVTG_OUT3B input is selected
 *  0b0110110..FC3_P0 (SDO, SDA) input is selected
 *  0b0110111..FC3_P1 (SCK, TXD, SCL) input is selected
 *  0b0111000..FC3_P2 (RTS, SCLS, TXD) input is selected
 *  0b0111001..FC3_P3 (PCS[0], CTS, SDAS) input is selected
 *  0b0111010..Reserved
 *  0b0111011..Reserved
 *  0b0111100..LP_FLEXCOMM0 trig 0 (lpuart_trg_txword) input is selected
 *  0b0111101..LP_FLEXCOMM0 trig 1 (lpuart_trg_rxword) input is selected
 *  0b0111110..LP_FLEXCOMM0 trig 2 (lpuart_trg_rxidle) input is selected
 *  0b0111111..LP_FLEXCOMM1 trig 0 input is selected
 *  0b1000000..LP_FLEXCOMM1 trig 1 input is selected
 *  0b1000001..LP_FLEXCOMM1 trig 2 input is selected
 *  0b1000010..LP_FLEXCOMM2 trig 0 input is selected
 *  0b1000011..LP_FLEXCOMM2 trig 1 input is selected
 *  0b1000100..LP_FLEXCOMM2 trig 2 input is selected
 *  0b1000101..LP_FLEXCOMM3 trig 0 input is selected
 *  0b1000110..LP_FLEXCOMM3 trig 1 input is selected
 *  0b1000111..LP_FLEXCOMM3 trig 2 input is selected
 *  0b1001000..LP_FLEXCOMM3 trig 3 input is selected
 *  0b1001001..SAI0 TX BCLK input is selected
 *  0b1001010..SAI0 RX BCLK input is selected
 *  0b1001011..SAI1 TX BCLK input is selected
 *  0b1001100..SAI1 RX BCLK input is selected
 */
#define INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX_INP(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX_INP_SHIFT)) & INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX_INP_MASK)
/*! @} */

/* The count of INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX */
#define INPUTMUX_INPUTMUX_SCT0_SCT0_INMUX_COUNT  (8U)

/*! @name CTIMER0CAP0 - Capture Select Register for CTIMER Inputs */
/*! @{ */

